OpenNuvoton/ML_M55M1_SampleCode/M55M1BSP-3.00.001/SampleCode/NuEdgeWise/FaceRecognition/main.cpp
/**************************************************************************//**
 * @file     main.cpp
 * @version  V1.00
 * @brief    MobileFaceNet network sample. Demonstrate face recognition
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

#include <vector>
#include <string>
#include <cinttypes>

#include "BoardInit.hpp"      /* Board initialisation */
#include "log_macros.h"      /* Logging macros (optional) */

#include "BufAttributes.hpp" /* Buffer attributes to be applied */
#include "InputFiles.hpp"             /* Baked-in input (not needed for live data) */
#include "FaceMobileNetModel.hpp"       /* Model API */
#include "Labels.hpp"
#include "Recognizer.hpp"
#include "FaceRecognProcessing.hpp"
#include "FaceDetectorPostProcessing.hpp"

#include "imlib.h"          /* Image processing */
#include "framebuffer.h"
#include "ModelFileReader.h"
#include "ff.h"

#undef PI /* PI macro conflict with CMSIS/DSP */
#include "NuMicro.h"

//#define __PROFILE__
#define __USE_CCAP__
#define __USE_DISPLAY__

#if defined (FACE_LANDMARK_ATTENTION_MODEL)
#define __LOAD_MODEL_FROM_SD__
#endif

#include "Profiler.hpp"

#if defined (__USE_CCAP__)
#include "ImageSensor.h"
#endif

#if defined (__USE_DISPLAY__)
    #include "Display.h"
#endif

#define NUM_FRAMEBUF 2  //1 or 2
#define MODEL_AT_HYPERRAM_ADDR (0x82400000)
#define FACE_PRESENCE_THRESHOLD  				(0.4)

typedef enum
{
    eFRAMEBUF_EMPTY,
    eFRAMEBUF_FULL,
    eFRAMEBUF_INF
} E_FRAMEBUF_STATE;

typedef struct
{
    E_FRAMEBUF_STATE eState;
    image_t frameImage;
    std::vector<arm::app::face_detection::DetectionResult> results_FD;	
    arm::app::RecognitionResult result_FR;
} S_FRAMEBUF;


S_FRAMEBUF s_asFramebuf[NUM_FRAMEBUF];

namespace arm
{
namespace app
{
/* Tensor arena buffer */
#undef ACTIVATION_BUF_SZ
#define FACE_RECOGNITION_ACTIVATION_BUF_SZ	 (460000)
#define FACE_DETECTION_ACTIVATION_BUF_SZ (460000)
static uint8_t tensorArena_FaceRecognition[FACE_RECOGNITION_ACTIVATION_BUF_SZ] ACTIVATION_BUF_ATTRIBUTE;
static uint8_t tensorArena_FaceDetection[FACE_DETECTION_ACTIVATION_BUF_SZ] ACTIVATION_BUF_ATTRIBUTE;

/* Optional getter function for the model pointer and its size. */
namespace face_detection
{
extern uint8_t *GetModelPointer();
extern size_t GetModelLen();
} /* namespace face_detection */

} /* namespace app */
} /* namespace arm */

//frame buffer managemnet function
static S_FRAMEBUF *get_empty_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_EMPTY)
            return &s_asFramebuf[i];
    }

    return NULL;
}

static S_FRAMEBUF *get_full_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_FULL)
            return &s_asFramebuf[i];
    }

    return NULL;
}

static S_FRAMEBUF *get_inf_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_INF)
            return &s_asFramebuf[i];
    }

    return NULL;
}

/* Image processing initiate function */
//Used by omv library
#if defined (__USE_CCAP__)
#define GLCD_WIDTH	224
#define GLCD_HEIGHT	224
#else
#define GLCD_WIDTH	IMAGE_WIDTH
#define GLCD_HEIGHT	IMAGE_HEIGHT
#endif

#undef OMV_FB_SIZE
#define OMV_FB_SIZE ((GLCD_WIDTH * GLCD_HEIGHT * 2) + 1024)

#undef OMV_FB_ALLOC_SIZE
#define OMV_FB_ALLOC_SIZE	(1*1024)

__attribute__((section(".bss.sram.data"), aligned(16))) static char fb_array[OMV_FB_SIZE + OMV_FB_ALLOC_SIZE];
__attribute__((section(".bss.sram.data"), aligned(16))) static char jpeg_array[OMV_JPEG_BUF_SIZE];

#if (NUM_FRAMEBUF == 2)
    __attribute__((section(".bss.sram.data"), aligned(32))) static char frame_buf1[OMV_FB_SIZE];
#endif

char *_fb_base = NULL;
char *_fb_end = NULL;
char *_jpeg_buf = NULL;
char *_fballoc = NULL;

static void omv_init()
{
    image_t frameBuffer;
    int i;

    frameBuffer.w = GLCD_WIDTH;
    frameBuffer.h = GLCD_HEIGHT;
    frameBuffer.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    frameBuffer.pixfmt = PIXFORMAT_RGB565;

    _fb_base = fb_array;
    _fb_end =  fb_array + OMV_FB_SIZE - 1;
    _fballoc = _fb_base + OMV_FB_SIZE + OMV_FB_ALLOC_SIZE;
    _jpeg_buf = jpeg_array;

    fb_alloc_init0();

    framebuffer_init0();
    framebuffer_init_from_image(&frameBuffer);

    for (i = 0 ; i < NUM_FRAMEBUF; i++)
    {
        s_asFramebuf[i].eState = eFRAMEBUF_EMPTY;
    }

    framebuffer_init_image(&s_asFramebuf[0].frameImage);

#if (NUM_FRAMEBUF == 2)
    s_asFramebuf[1].frameImage.w = GLCD_WIDTH;
    s_asFramebuf[1].frameImage.h = GLCD_HEIGHT;
    s_asFramebuf[1].frameImage.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    s_asFramebuf[1].frameImage.pixfmt = PIXFORMAT_RGB565;
    s_asFramebuf[1].frameImage.data = (uint8_t *)frame_buf1;
#endif
}

static void DrawDetectFace(
    std::vector<arm::app::face_detection::DetectionResult> &results,
    image_t *drawImg
)
{
	arm::app::face_detection::DetectionResult faceBox;
	int faceBoxSize = results.size();
	
	for(int i = 0; i < faceBoxSize; i ++)
	{
		faceBox = results[i];
		info("Face detect on image (x,y,w,h) => (%d, %d, %d, %d)\n", faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h);
		imlib_draw_rectangle(drawImg, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h, COLOR_B5_MAX, 2, false);
	}
}

static void FaceRecognize(
    S_FRAMEBUF *infFramebuf,
    arm::app::FaceMobileNetModel *faceRecognitionModel,	
	arm::app::FaceRecognPostProcess *postProcess,
	arm::app::Profiler *profiler
)
{
	arm::app::face_detection::DetectionResult faceBox;
    rectangle_t roi;
    TfLiteIntArray *inputShape = faceRecognitionModel->GetInputShape(0);
    TfLiteTensor *inputTensor   = faceRecognitionModel->GetInputTensor(0);

    const int inputImgCols = inputShape->data[arm::app::FaceMobileNetModel::ms_inputColsIdx];
    const int inputImgRows = inputShape->data[arm::app::FaceMobileNetModel::ms_inputRowsIdx];

	uint64_t u64StartCycle;
	uint64_t u64EndCycle;

	//Quantize input tensor data
	auto *req_data = static_cast<uint8_t *>(inputTensor->data.data);
	auto *signed_req_data = static_cast<int8_t *>(inputTensor->data.data);

