OpenNuvoton/ML_M55M1_SampleCode/M55M1BSP-3.00.001/SampleCode/NuEdgeWise/FaceRecognition/main.cpp
#define EACH_PERF_SEC 5
    uint64_t u64PerfCycle;
    uint64_t u64PerfFrames = 0;

    u64PerfCycle = pmu_get_systick_Count();
    u64PerfCycle += (SystemCoreClock * EACH_PERF_SEC);

    S_FRAMEBUF *infFramebuf;
    S_FRAMEBUF *fullFramebuf;
    S_FRAMEBUF *emptyFramebuf;

#if !defined (__USE_CCAP__)
    uint8_t u8ImgIdx = 0;
    char chStdIn;
#endif

#if defined (__USE_CCAP__)
    //Setup image senosr
    ImageSensor_Init();
    ImageSensor_Config(eIMAGE_FMT_RGB565, frameBuffer.w, frameBuffer.h, true);
#endif

#if defined (__USE_DISPLAY__)
    char szDisplayText[100];
    S_DISP_RECT sDispRect;

    Display_Init();
    Display_ClearLCD(C_WHITE);
#endif

    std::string predictLabelInfo;

    while(1)
    {
        emptyFramebuf = get_empty_framebuf();

        if (emptyFramebuf)
        {
#if !defined (__USE_CCAP__)
            info("Press 'n' to run next image inference \n");
            info("Press 'q' to exit program \n");

            while ((chStdIn = getchar()))
            {
                if (chStdIn == 'q')
                {
                    goto prog_done;
                }
                else if (chStdIn != 'n')
                {
                    break;
                }
            }

            const uint8_t *pu8ImgSrc = get_img_array(u8ImgIdx);

            if (nullptr == pu8ImgSrc)
            {
                printf_err("Failed to get image index %" PRIu32 " (max: %u)\n", u8ImgIdx,
                           NUMBER_OF_FILES - 1);
                goto prog_done;
            }

            u8ImgIdx ++;

            if (u8ImgIdx >= NUMBER_OF_FILES)
                u8ImgIdx = 0;


            //copy source image to frame buffer
            image_t srcImg;

            srcImg.w = IMAGE_WIDTH;
            srcImg.h = IMAGE_HEIGHT;
            srcImg.data = (uint8_t *)pu8ImgSrc;
            srcImg.pixfmt = PIXFORMAT_RGB888;

            roi.x = 0;
            roi.y = 0;
            roi.w = IMAGE_WIDTH;
            roi.h = IMAGE_HEIGHT;

            imlib_nvt_scale(&srcImg, &emptyFramebuf->frameImage, &roi);
			
#endif

            //capture frame from CCAP
#if defined(__PROFILE__)
            u64CCAPStartCycle = pmu_get_systick_Count();
#endif

#if defined (__USE_CCAP__)
            ImageSensor_TriggerCapture((uint32_t)(emptyFramebuf->frameImage.data));
#endif
		}
		
        fullFramebuf = get_full_framebuf();

        if (fullFramebuf)
        {
#if defined(__PROFILE__)
			DetectFaceRegion(
					fullFramebuf,
					&faceDetectionModel,
					&postProcess_FD,
					&profiler);
#else
			DetectFaceRegion(
					fullFramebuf,
					&faceDetectionModel,
					&postProcess_FD,
					nullptr);
#endif
			fullFramebuf->eState = eFRAMEBUF_INF;
        }
		
        infFramebuf = get_inf_framebuf();

        if (infFramebuf)
        {

#if defined(__PROFILE__)
			if(infFramebuf->results_FD.size())
				FaceRecognize(
						infFramebuf,
						&faceRecognitionModel,
						&postProcess_FR,
						&profiler);
#else
			if(infFramebuf->results_FD.size())
				FaceRecognize(
						infFramebuf,
						&faceRecognitionModel,
						&postProcess_FR,
						nullptr);
#endif
			
			
            //display result image
#if defined (__USE_DISPLAY__)
            //Display image on LCD
            sDispRect.u32TopLeftX = 0;
            sDispRect.u32TopLeftY = 0;
            sDispRect.u32BottonRightX = (infFramebuf->frameImage.w - 1);
            sDispRect.u32BottonRightY = (infFramebuf->frameImage.h - 1);

#if defined(__PROFILE__)
            u64StartCycle = pmu_get_systick_Count();
#endif

            Display_FillRect((uint16_t *)infFramebuf->frameImage.data, &sDispRect);

#if defined(__PROFILE__)
            u64EndCycle = pmu_get_systick_Count();
            info("display image cycles %llu \n", (u64EndCycle - u64StartCycle));
#endif

#endif
			if(infFramebuf->results_FD.size()){
				if(infFramebuf->result_FR.m_recognize)
				{
					predictLabelInfo =  infFramebuf->result_FR.m_label + std::string(":") + std::to_string(infFramebuf->result_FR.m_predict);
				}
				else
				{
					predictLabelInfo = std::string("???") + std::string(":") + std::to_string(infFramebuf->result_FR.m_predict);
				}
					
				//show result
				info("Final results:\n");
				info("%s\n", predictLabelInfo.c_str());
			}

#if defined (__USE_DISPLAY__)

			sDispRect.u32TopLeftX = 0;
			sDispRect.u32TopLeftY = frameBuffer.h;
			sDispRect.u32BottonRightX = (frameBuffer.w);
			sDispRect.u32BottonRightY = (frameBuffer.h + FONT_HTIGHT - 1);

			Display_ClearRect(C_WHITE, &sDispRect);

			if(infFramebuf->results_FD.size()){
				sprintf(szDisplayText, "%s", predictLabelInfo.c_str());

				Display_PutText(
					szDisplayText,
					strlen(szDisplayText),
					0,
					frameBuffer.h,
					C_BLUE,
					C_WHITE,
					true
				);
			}
#endif
			
			
            u64PerfFrames ++;
			if ((uint64_t) pmu_get_systick_Count() > u64PerfCycle)
            {
                info("Total inference rate: %llu\n", u64PerfFrames / EACH_PERF_SEC);
#if defined (__USE_DISPLAY__)
                sprintf(szDisplayText, "Frame Rate %llu", u64PerfFrames / EACH_PERF_SEC);
                //sprintf(szDisplayText,"Time %llu",(uint64_t) pmu_get_systick_Count() / (uint64_t)SystemCoreClock);
                //info("Running %s sec \n", szDisplayText);

                sDispRect.u32TopLeftX = 0;
                sDispRect.u32TopLeftY = frameBuffer.h + FONT_HTIGHT;
                sDispRect.u32BottonRightX = (frameBuffer.w);
                sDispRect.u32BottonRightY = (frameBuffer.h + (2 * FONT_HTIGHT) - 1);

                Display_ClearRect(C_WHITE, &sDispRect);
                Display_PutText(
                    szDisplayText,
                    strlen(szDisplayText),
                    0,
                    frameBuffer.h + FONT_HTIGHT,
                    C_BLUE,
                    C_WHITE,
                    false
                );
#endif
                u64PerfCycle = (uint64_t)pmu_get_systick_Count() + (uint64_t)(SystemCoreClock * EACH_PERF_SEC);
                u64PerfFrames = 0;
			}

            infFramebuf->eState = eFRAMEBUF_EMPTY;
		}

		//Wait CCAP ready
		if (emptyFramebuf)
		{
#if defined (__USE_CCAP__)			
			//Capture new image
			ImageSensor_WaitCaptureDone();
#endif
#if defined(__PROFILE__)
			u64CCAPEndCycle = pmu_get_systick_Count();
			info("ccap capture cycles %llu \n", (u64CCAPEndCycle - u64CCAPStartCycle));
#endif
            emptyFramebuf->eState = eFRAMEBUF_FULL;		
		}			
	}

prog_done:
	
	return 0;
}